10/data/attachments/a786148c5320828f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Shawn_two_Actions_39273_1</nif:username>
            <nif:friendToBeRequested>soap_actions_d7692a9d-d0ce-457b-9faf-562185c50258</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>